/**
 * Функция getMonthName принимает на вход число (порядковый номер) месяца от 1 до 12 и возвращает его название.
 *
 * Месяц должен возвращаться с заглавной буквы. Все возможные варианты (выводить без дополнительных кавычек):
 *   "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"
 *
 * Если передан неправильное число (не в диапазоне от 1 до 12), то возвращать "Такого месяца нет".
 *
 * Задачу можно выполнить на 3 уровня сложности:
 * 1) Easy: используя инструкцию if...else
 * 2) Medium: используя инструкцию switch...case https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Statements/switch
 * 3) Hard: Используя массив или объект (без if...else и без switch...case)
 * */

const getMonthName = (monthIndex) => {
};

// getMonthName(3); // Возвращает Март
// getMonthName(13); // Возвращает Такого месяца нет

module.exports = { getMonthName };

